[
  {
    "Descripción": "GitLab\n4.1\nData System Architect, Data Engineering & Monetization New\n\nRemote\n\nGitLab is an open-core software company that develops the most comprehensive AI-powered DevSecOps Platform, used by more than 100,000 organizations. Our mission is to enable everyone to contribute to and co-create the software that powers our world. When everyone can contribute, consumers become contributors, significantly accelerating human progress. Our platform unites teams and organizations, breaking down barriers and redefining what's possible in software development. Thanks to products like Duo Enterprise and Duo Agent Platform, customers get AI benefits at every stage of the SDLC.\n\n\n\nThe same principles built into our products are reflected in how our team works: we embrace AI as a core productivity multiplier, with all team members expected to incorporate AI into their daily workflows to drive efficiency, innovation, and impact. GitLab is where careers accelerate, innovation flourishes, and every voice is valued. Our high-performance culture is driven by our values and continuous knowledge exchange, enabling our team members to reach their full potential while collaborating with industry leaders to solve complex problems. Co-create the future with us as we build technology that transforms how the world develops software.\n\nAn overview of this role\n\n\n\nJoin GitLab as Data System Architect to drive our strategic data platform evolution. You'll architect scalable, distributed solutions that transform how we manage and leverage data across our SaaS and self-managed deployments, supporting enterprise-scale growth and innovation.\n\n\n\nWhat You’ll Do\n\n\n\n\nDrive architectural vision for scalable, distributed data systems across SaaS and self-managed deployments, designing database stack solutions that optimize OLTP/OLAP performance and scalability requirements\n\n\nDefine enterprise data product standards and governance frameworks including data lineage, SDLC, versioning, and compliance practices for regulated environments\n\n\nBuild governed, monetizable data services and APIs that support both internal operations/analytics and external SaaS product offerings with semantic structure\n\n\nPartner with product and engineering teams to embed modern agentic and AI-driven patterns into data infrastructure and customer-facing solutions\n\n\nArchitect event-driven systems and cross-stack orchestration supporting hybrid transformations through tools like Argo, Airflow, and Kubernetes with unified metadata-rich telemetry\n\n\nDesign end-to-end data lifecycle architecture covering integration, pipelines, transformation workflows, and consolidated metadata systems across multiple platforms\n\n\nEstablish CI/CD best practices for data systems ensuring reliable deployment, monitoring, and maintenance across diverse deployment models\n\n\nTransform ambiguity into strategic roadmaps and lead complex technical engagements where data architecture creates competitive differentiation\n\n\n\n\nWhat You’ll Bring\n\n\n\n\nExperience architecting large-scale distributed data systems in complex, regulated domains with unified platforms integrating cloud-native compute, orchestration, and semantic modeling\n\n\nDemonstrated leadership building multi-modal data services with strong developer experience principles, focusing on monetization, governance, and data product lifecycle management\n\n\nHands-on expertise with modern data stack technologies including Python, Docker, Airflow, Trino, Postgres, distributed query engines, and graph-based metadata systems, integrating them into the GitLab ecosystem comprised of Ruby on Rails and Go services.\n\n\nAdvanced knowledge bridging cloud and on-premises deployments with automation, developer self-service focus, and data integration through connector marketplaces\n\n\nDeep understanding of data processing paradigms and standards including synchronous vs. asynchronous processing, schema management, logical data modeling, and formats like OpenTelemetry, OpenMetadata, and OpenLineage\n\n\nExperience with AI-driven architectures and emerging technologies including model orchestration, agentic patterns, and standards like MCP (Model Context Protocol)\n\n\nStrong architectural opinions on cost-aware, resilient solutions that optimize entire data lifecycle decisions with focus on scalability and performance trade-offs\n\n\nPassion for open source platforms, team mentorship, and collaborative values with ability to build scalable solutions that align with organizational culture and technical excellence\n\n\n\n\nAbout the team\n\n\n\nData Engineering and Monetization is a newly formed function within the Engineering Org with a mission to build a comprehensive foundation of data platforms with responsible data architecture that scales.\n\n\n\nHow GitLab will support you\n\n\nBenefits to support your health, finances, and well-being\n\n\nFlexible Paid Time Off\n\n\nTeam Member Resource Groups\n\n\nEquity Compensation & Employee Stock Purchase Plan\n\n\nGrowth and Development Fund\n\n\nParental leave\n\n\nHome office support\n\n\n\n\nPlease note that we welcome interest from candidates with varying levels of experience; many successful candidates do not meet every single requirement. Additionally, studies have shown that people from underrepresented groups are less likely to apply to a job unless they meet every single qualification. If you're excited about this role, please apply and allow our recruiters to assess your application.\n\nThe base salary range for this role’s listed level is currently for residents of listed locations only. Grade level and salary ranges are determined through interviews and a review of education, experience, knowledge, skills, abilities of the applicant, equity with other team members, and alignment with market data. See more information on our \nbenefits\n and \nequity\n. Sales roles are also eligible for incentive pay targeted at up to 100% of the offered base salary.\n\nCalifornia/Colorado/Hawaii/New Jersey/New York/Washington/DC/Illinois/Minnesota pay range\n\n$157,900 - $236,900 USD\n\n\n\nCountry Hiring Guidelines: \nGitLab hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.\n\n\n\nPrivacy Policy: \nPlease review our Recruitment Privacy Policy. Your privacy is important to us.\n\n\n\nGitLab is proud to be an equal opportunity workplace and is an affirmative action employer. GitLab’s policies and practices relating to recruitment, employment, career development and advancement, promotion, and retirement are based solely on merit, regardless of race, color, religion, ancestry, sex (including pregnancy, lactation, sexual orientation, gender identity, or gender expression), national origin, age, citizenship, marital status, mental or physical disability, genetic information (including family medical history), discharge status from the military, protected veteran status (which includes disabled veterans, recently separated veterans, active duty wartime or campaign badge veterans, and Armed Forces service medal veterans), or any other basis protected by law. GitLab will not tolerate discrimination or harassment based on any of these characteristics. See also GitLab’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know during the recruiting process.\nMostrar más\nConsulta evaluaciones de la empresa\nEsta empresa ya no tendrá secretos para ti\nInicia sesión para buscar evaluaciones auténticas, calificaciones anónimas y datos sobre los sueldos antes de postularte.\nIniciar sesión\n4.1\n74 %\nRecomendar a un amigo\n55 %\nAprobación del CEO\nCEO: Bill Staples\nCalificaciones 16",
    "Enlace": "https://www.glassdoor.com/job-listing/data-system-architect-data-engineering-monetization-new-gitlab-JV_KO0,55_KE56,62.htm?jl=1009834151298"
  },
  {
    "Descripción": "Echo Neurotechnologies\nBackend Software Architect - Python\nInicia sesión para postularte\nSan Francisco, CA\nInicia sesión para postularte\nCompany Overview\n\nEcho Neurotechnologies is an exciting new startup in the Brain-Computer Interface (BCI) space, driving innovation through advanced hardware engineering and AI solutions. Our mission is to deliver cutting-edge technologies that restore autonomy to people living with disabilities and improve their quality of life.\n\nTeam Culture\n\nJoin a small, dedicated team of knowledgeable and motivated professionals. Our early-stage environment offers the opportunity to take ownership of broad decisions with significant and long-lasting impact. We emphasize continuous learning and growth, fostering cross-functional collaboration where your contributions are vital to our success.\n\nJob Description\n\nWe are seeking an experienced Backend Software Architect to join our growing team. You'll design and develop the server-side infrastructure for a connected medical device. This is a greenfield opportunity to shape cloud systems that support secure data, AI workflows, and device integration.\n\nRole Responsibilities\n\nDesign and implement a robust server-side system architecture in a public cloud environment.\n\nBuild APIs, data pipelines, and secure storage layers.\n\nContribute to critical system design decisions affecting device and client software.\n\nDocument architectural designs and key decision-making processes.\n\nEnsure compliance with medical software standards and regulations.\n\nFollow coding best practices to create and maintain reproducible, clear, and highly documented code.\n\nRole Qualifications\n\nRequired Qualifications\n\nExtensive experience in building cloud-based software systems.\n\nExpertise in production-quality Python for backend systems.\n\nProficiency in designing data pipelines, databases, application servers, and storage solutions.\n\nUnderstanding of the end-to-end software lifecycle for medical data products.\n\nExperience building HIPAA-compliant systems that handle PHI and PII.\n\nPractical knowledge of cybersecurity best practices.\n\nPreferred Qualifications\n\nFamiliarity with medical sensor data, time series data, and/or brain data.\n\nExperience integrating with modern ML and Data Science workflows.\n\nCI/CD and DevOps experience, particularly in Azure.\n\nWhat We Offer\n\nAn opportunity to work on exciting, cutting-edge projects to transform patients’ lives in a highly collaborative work environment.\n\nCompetitive compensation, including stock options.\n\nComprehensive benefits package.\n\n401(k) program with matching contributions.\n\nEqual Opportunity Employer\n\nEcho Neurotechnologies is an Equal Opportunity Employer (EOE). We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nConfidentiality\n\nAll applications will be treated confidentially. Applicants may be asked to sign an NDA after the initial stages of the interview process.",
    "Enlace": "https://www.glassdoor.com/job-listing/backend-software-architect-python-echo-neurotechnologies-JV_IC1147401_KO0,33_KE34,56.htm?jl=1009816765091"
  },
  {
    "Descripción": "BLOCKSKYE INC\n3.2\nSoftware Architect (PHP + Blockchain)\n\nBoston, MA\n\nDescription:\n\n\nAbout Blockskye\n\nBlockskye provides next-generation inventory booking, payment, and dynamic expense solutions for the travel and entertainment industries using blockchain. We connect suppliers and corporate buyers with blockchain technology thereby achieving greater transparency, trust, and efficiency in transaction, inventory, and booking management. Our solution is governed by industry stakeholders with a focus on supplier and corporate buyer participation. This inclusive approach has enabled us to deploy blockchain fairly quickly within the industry. We believe in inter-enterprise, real-time accounting integrations as a foundation for distributed ledger technology, private, and public blockchains.\n\nAbout the Team\n\nOur technology team operates with a clear mission: Build with trust. Navigate with purpose. Launch with pride. We’re guided by core tenets: Curiosity, Discipline, Excellence, Thoughtfulness, and Intent, and believe that great technology is built by people who ask “why,” care deeply about outcomes, and never settle for “good enough.” Every line of code, every deployment, and every retrospective is a chance to raise the bar, for ourselves and for the industry.\n\nOverview\n\nBlockskye is seeking a thoughtful and experienced Software Architect to design and guide the development of scalable, high-performance systems that power our blockchain-enabled travel and expense infrastructure. In this role, you’ll work closely with engineering leads and product stakeholders to define architecture, improve system reliability, and ensure technical consistency across projects.\n\nYou’ll play a critical role in shaping both the structure of our platform and the standards by which we build it, balancing long-term technical vision with pragmatic delivery. The ideal candidate has a strong background in modern web architectures (Laravel, Node.js, AWS), demonstrates deep systems thinking, and is comfortable operating across multiple teams.\n\nWe value engineers who prioritize clarity, maintainability, and simplicity — and who enjoy mentoring others while leading by example. Excellent fluency in oral and written English is essential for collaborating across our remote-first team.\n\nResponsibilities:\n\nHands-on coding solving complex problems\n\nDesign and evolve the overall software architecture for Blockskye’s core platform, ensuring scalability, maintainability, and performance across services\n\nCollaborate with engineering leadership and product stakeholders to translate business goals into robust technical solutions\n\nDefine and enforce coding standards, architectural patterns, and system design best practices across engineering teams\n\nProvide hands-on guidance and mentorship to developers during system design, implementation, and code reviews\n\nLead architectural decision-making for major new initiatives, integrations, and platform enhancements\n\nEvaluate and select tools, frameworks, and third-party solutions aligned with business and technical requirements\n\nPartner with DevOps and Infrastructure teams to ensure highly available, secure, and observable cloud-native systems (primarily in AWS)\n\nCreate and maintain technical documentation for architecture diagrams, workflows, and system dependencies\n\nCreate and maintain technical documentation for architecture diagrams, workflows, and system dependencies\n\nContribute to system reliability and performance by identifying and resolving bottlenecks, inefficiencies, or architectural debt\n\nParticipate in early-stage technical scoping and estimation for roadmap initiatives\n\nDrive the adoption of modern development practices such as microservices, event-driven architecture, and CI/CD\n\nReview and guide API design (REST, Webhooks, etc.) to ensure clean, consistent, and versioned interfaces across teams and external partners\n\nHelp facilitate cross-team architectural alignment and knowledge sharing through regular design reviews and technical discussions\n\nSupport compliance, security, and data governance requirements from an architectural perspective (e.g., data flow diagrams, access controls)\n\nStay current with emerging technologies, tools, and architectural patterns to inform long-term platform evolution\n\nServe as a key thought partner in Blockskye’s transition from a startup architecture to an enterprise-grade platform\n\nRequirements:\n\nBachelor’s degree in Computer Science, Software Engineering, or a related field; advanced degree preferred\n\n8+ years of progressive experience in software development, including at least 2–3 years in an architecture or senior technical leadership role\n\nDeep expertise in backend development with modern frameworks such as Laravel/PHP and Node.js\n\nStrong understanding of software architecture patterns, including microservices, event-driven systems, and domain-driven design\n\nDemonstrated experience designing scalable, cloud-native systems, particularly on AWS (e.g., Lambda, RDS, S3, ECS/Fargate)\n\nProficiency in designing and maintaining secure, maintainable, and well-documented RESTful APIs and system interfaces\n\nStrong working knowledge of databases, including MySQL and caching strategies (e.g., Redis), with experience in query optimization and data modeling\n\nExperience with CI/CD pipelines, infrastructure-as-code, and observability tools (e.g., CloudWatch, Datadog, Sentry)\n\nAbility to translate business requirements into high-level system designs and detailed technical specifications\n\nProven ability to mentor engineers, lead cross-functional technical discussions, and drive consensus\n\nExcellent communication and interpersonal skills, with fluency in written and spoken English for remote collaboration\n\nComfort operating in a remote-first, startup-to-scaleup environment with evolving systems and priorities\n\nA collaborative mindset and a strong sense of ownership, quality, and continuous improvement\n\nBonus Qualifications:\n\nExperience with blockchain technologies, smart contracts, or distributed ledger integrations\n\nBackground in travel, fintech, or enterprise SaaS platforms\n\nExperience modernizing legacy systems or leading platform migrations\n\nFamiliarity with WebSockets, GraphQL, or message queue systems (e.g., SQS, Kafka)\n\nThis job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required. Duties, responsibilities and activities may change or new ones may be assigned at any time with or without notice.\n\nBlockskye is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, genetic information, national origin, disability, or veteran status.\nMostrar más\nConsulta evaluaciones de la empresa\nEsta empresa ya no tendrá secretos para ti\nInicia sesión para buscar evaluaciones auténticas, calificaciones anónimas y datos sobre los sueldos antes de postularte.\nIniciar sesión\n3.2\n47 %\nRecomendar a un amigo\nN/A \nAprobación del CEO\nCEO: Calificaciones 0",
    "Enlace": "https://www.glassdoor.com/job-listing/software-architect-php-blockchain-blockskye-inc-JV_IC1154532_KO0,33_KE34,47.htm?jl=1009783516575"
  },
  {
    "Descripción": "Vettura\nSenior Software Architect\nInicia sesión para postularte\nAustin, TX\nInicia sesión para postularte\nAt \nVettura\n, we're building solutions that make a real difference in the world of AI and talent-driven innovation—and we’re looking for a \nSenior Software Architect\n to help us lead that charge. In this role, you’ll be instrumental in designing and developing scalable software systems that power our platforms and services. If you're a seasoned engineer with deep experience in C#, Azure Cloud, and DevOps, this could be the perfect opportunity to make a big impact.\n\nNote: Onsite in Austin, TX. 4 days in office\n\nWe’re looking for someone who thrives on solving complex challenges, is comfortable working across various technology stacks, and is passionate about creating high-performance, cloud-native applications.\n\nWhat You'll Be Doing\n\nArchitect, design, and develop cloud-based solutions to handle large-scale data processing and storage.\n\nEnsure systems are secure, efficient, and compliant—especially when moving and managing large datasets.\n\nTroubleshoot and resolve technical issues with a creative, hands-on approach.\n\nCollaborate across teams to develop integrated software solutions using modern cloud services.\n\nWrite clean, well-documented code along with technical diagrams and documentation to support low-level designs.\n\nMentor junior engineers, lead code reviews, and help maintain architectural consistency and code quality.\n\nEnsure compliance with internal policies and industry standards for privacy, security, and quality.\n\nWork closely with cross-functional teams to gather requirements and support solution design.\n\nCommunicate effectively with product managers, project leaders, and technical teams to share updates, architecture plans, and risk assessments.\n\nCreate and maintain product requirements, technical specifications, and design documents.\n\nProvide ongoing support for development teams and help troubleshoot issues post-release.\n\nWhat We're Looking For\n\nStrong understanding of cloud computing technologies and design patterns.\n\nExperience designing secure, high-performance solutions in Microsoft Azure (experience with AWS or GCP is a plus).\n\nProven ability to work with:\n\nAzure-native services (Functions, Service Bus, EventGrid, etc.)\n\nMicroservices and service-oriented architecture (SOA)\n\nNoSQL and relational databases\n\nLogging and monitoring tools within Azure\n\nExcellent collaboration and communication skills.\n\nA proactive mindset, with strong analytical and problem-solving abilities.\n\nMinimum Qualifications\n\nMaster’s degree in Computer Science or related discipline.\n\n6–8 years of professional experience in software engineering.\n\nDeep experience across multiple tech stacks, particularly with Azure and .NET/C#.\nMostrar más\nEncuentra el empleo de tus sueños\nLee reseñas auténticas con una cuenta de Glassdoor. Postúlate únicamente a los empleos que te gusten.\nIniciar sesión",
    "Enlace": "https://www.glassdoor.com/job-listing/senior-software-architect-vettura-JV_IC1139761_KO0,25_KE26,33.htm?jl=1009788611942"
  },
  {
    "Descripción": "MAPFRE PUERTO RICO\n3.8\nData Architect\nInicia sesión para postularte\nSan Juan, PR\nInicia sesión para postularte\nEl tiempo que inviertes en \nMAPFRE\n cobra sentido. Ponemos a tu alcance oportunidades de desarrollo profesional valorando la diversidad. Aquí podrás transformar tu tiempo en aprendizaje y experiencias. Nuestro entorno abierto y colaborativo de trabajo está lleno de oportunidades y retos apasionantes en el que las personas son el centro, te permite aportar soluciones innovadoras que mejoran la vida de las personas.\nActualmente contamos con una oportunidad de empleo para un(a) \nArquitecto de Data \npara nuestra oficina central en Hato Rey.\nRequisitos:\nBachillerato en: Ciencias de Computadoras, Informática, Ingeniera de Software o campos relacionados.\n5 años de experiencia como arquitecto de data.\nExperiencia en la industra de seguros, preferiblemente.\nBilingüe\nTareas:\nAnalizar los requisitos del negocio y traducirlos en especificaciones y soluciones técnicas.\nColaborar con equipos multifuncionales, como gestores de proyectos, analistas de negocio, testers y otros arquitectos.\nCrear arquitecturas de referencia para las distintas soluciones, estándares de intercambio de datos entre compañías y soluciones pensando en dominios funcionales\nEvaluar productos creados por entes externas y ver como su arquitectura integra y cumple con nuestro criterio\nAsegurar el cumplimiento de las mejores prácticas, estándares y metodologías para el desarrollo de software y la arquitectura.\nMonitorear y mejorar continuamente la calidad, el rendimiento y la fiabilidad de las soluciones.\nIdentificar y mitigar riesgos de los aplicativos de Seguridad, obsolescencia, vulnerabilidades entre otros.\nBuscar tecnologías emergentes y desarrollar pruebas de conceptos con el fin de traer una eficiencia operacional\nCapacidad para manejar múltiples proyectos simultáneamente con Experiencia en el ciclo completo de proyectos desde la concepción hasta la implementación\nHabilidad de identificar problemas complejos del cliente y proponer soluciones las cuales brinden mejora operacional\nDiseño y modelaje de datos en diferentes niveles y propósitos\nConocimiento de herramientas de datos en clouds públicos como AWS o Azure\nExperiencia aplicando arquitecturas para aplicaciones de alto rendimiento y escalabilidad.\nDestrezas Técnicas:\nExperiencia avanzada en diseño, modelado y optimización de bases de datos y dominio de herramientas de modelado de datos\nConocimiento en administración, optimización y securización de SQL Server y Oracle, incluyendo instalación, configuración, mantenimiento, backups, recuperación y optimización de rendimiento\nExperiencia en diseño e implementación de data warehouses y data lakes empresariales\nConocimiento práctico de tecnologías Big Data como Hadoop, Spark y bases de datos NoSQL (MongoDB, Cassandra)\nSalario: \nA evaluar\nBono Variable \nBeneficios:\nPlan de Retiro y Ahorros (401K) pareo dólar a dólar hasta un 6% del salario,\nSeguro de Vida,\nPlan Médico,\n15 días de vacaciones anuales,\nModerno gimnasio en edificio central, cafetería, consultorio médico,\nPrograma de Desarrollo Profesional\nPrograma de Ayuda al empleado,\nDescuento en Seguros de la compañía,\nProgramas de Reconocimientos,\nFerias de Salud,\nActividades para empleados y otros beneficios opcionales.\nPatrono con Igualdad de Oportunidades en el Empleo y Acción Afirmativa para Mujeres, Minorías, Veteranos y Personas con Discapacidad.\nTipo de puesto: Tiempo completo\nHorario: 8:15 am a 4:45 pm\nJob Type: Full-time\nPay: $5,000.00 - $6,000.00 per month\nBenefits:\n401(k)\nHealth insurance\nWork Location: In person\nMostrar más\nConsulta evaluaciones de la empresa\nEsta empresa ya no tendrá secretos para ti\nInicia sesión para buscar evaluaciones auténticas, calificaciones anónimas y datos sobre los sueldos antes de postularte.\nIniciar sesión\n3.8\n73 %\nRecomendar a un amigo\n78 %\nAprobación del CEO\nCEO: Antonio Huertas\nCalificaciones 299",
    "Enlace": "https://www.glassdoor.com/job-listing/data-architect-mapfre-puerto-rico-JV_IC1141599_KO0,14_KE15,33.htm?jl=1009827830017"
  },
  {
    "Descripción": "UCSF Health\n3.7\nData Warehouse Architect\n\nSan Francisco, CA\n\nThe Data Warehouse Architect in Enterprise Information & Analytics (EIA) designs the Scuba data warehouse ecosystem with a focus on ambulatory-related data. The role involves leading data warehouse operations, collaborating with stakeholders, providing technical direction, optimizing performance, driving innovation, and establishing data governance and standardization to align with business objectives.\n\n\nArchitecture: Design both backend and frontend of the Scuba data warehouse ecosystem, including specialized data assets like DART, focusing on ambulatory-related data models and visualization solutions. Design and implement efficient and adaptable data models to support data exploration, data science, and analytics, resulting in insights that inform key business decisions.\nOperations: Lead data warehouse operations in collaboration with EIA colleagues. Design, develop, and optimize ETL workflows to support ambulatory business functions.\nTechnical Leadership: Provide technical direction for analysts and developers in EIA, guiding them in creating trusted data assets and conducting code reviews. Serve as a subject matter expert in data warehouse concepts such as Kimball, star schema, snowflake schemas, and normalized and dimensional data models.\nStakeholder Collaboration: Serve as a valued partner to stakeholders in the ambulatory business unit, offering data and analytics solutions while demonstrating a deep understanding of their business goals and operational objectives. Collaborate with departmental data stewards and technical system owners to establish a comprehensive understanding of the organization’s processes and data, ensuring alignment with ambulatory business needs.\nCommunication: Translate business requirements from the ambulatory unit into technical specifications, ensuring alignment with organizational goals and addressing business needs.\nPerformance Monitoring and Optimization: Proactively monitor and analyze performance to identify and recommend optimizations, enhancing system performance.\nInnovation: Stay current with the latest trends in data and analytics technologies, and drive innovation for the Scuba data warehouse ecosystem.\nGovernance and Standards: Play an active role in establishing data governance and standardization, ensuring new and existing data assets conform to UCSF standards with appropriate access controls.\n\nThe final salary and offer components are subject to additional approvals based on UC policy.\n\nYour placement within the salary range is dependent on a number of factors including your work experience and internal equity within this position classification at UCSF. For positions that are represented by a labor union, placement within the salary range will be guided by the rules in the collective bargaining agreement.\n\nThe salary range for this position is $190,000 to $210,000 (Annual Rate).\n\nTo learn more about the benefits of working at UCSF, including total compensation, please visit: https://ucnet.universityofcalifornia.edu/compensation-and-benefits/index.html\n\n\nDepartment Description\n\n\nThe mission of the Enterprise Information and Analytics (EIA) department is to advance UCSF’s institutional priorities by enhancing access to and the use of data and analytics, including appropriate data platforms and data governance, in a manner that meets the unique needs across the education, research, and care mission areas. The department achieves its goals by working with clinical, research, education, and business partners to organize, integrate, govern, and transform UCSF’s data assets into actionable insight and information.\n\n\nRequired Qualifications\n\n\nBachelor's degree in related area and / or equivalent experience / training.\n\nMinimum 7 Years experience in a like role and institution\n\nSignificant hands-on experience with Microsoft SQL Server and SSIS\n\nSignificant hands-on experience with Tableau BI or other similar visualization applications\n\nAdvanced skills associated with programming design, modification and implementation. In-depth knowledge of secure software development. Requires in-depth knowledge of applications programming technologies, development tools and protocols.\n\nIn-depth knowledge of business and process analysis functions. Knowledge of the design, development and application of technology and systems to meet business needs. Demonstrated ability to create software specifications.\n\nDemonstrated experience with database administration. Advanced knowledge of complex database management systems and standards. Knowledge relating to extremely highly complex database system design. Advanced database querying and modeling skills working with moderately complex databases. In-depth knowledge of conceptual database design. Skills necessary to develop procedures and standards relating to database management systems. Skills associated with implementing database enhancements that improve performance and reliability of the system at the software, hardware and operating system level.\n\nFamiliarity with logical data design and data mapping or data conversion.\n\nExpert knowledge of test application code in client server environment.\n\nAbility to write technical documentation in a clear and concise manner.\n\nFamiliarity with data quality and governance issues and requirements.\n\nPossesses advanced knowledge of professional IT concepts. Broad knowledge of the IT environment.\n\nDemonstrated advanced knowledge, skills and abilities associated with system problem identification and resolution. Knowledge necessary to design, set up, operate and correct malfunctions involving technology systems. Experience in incident response and digital forensics, including data collection, examination and analysis.\n\nIn-depth knowledge of computer security tools, best practices and policies including demonstrated experience securing server-based software. Expert knowledge of computer security tools, best practices and policies including demonstrated experience securing server-based software. Demonstrated skill at analyzing and preventing security incidents of high complexity. Strong security skills for protecting the operating system, software, data and hardware.\n\nDemonstrated comprehensive understanding of how system management actions affect other systems, system users and dependent / related functions. Experience in data integration and the specification of data services. Ability to understand and model complex knowledge-intensive processes such as scholarly and research processes.\n\nTechnical skill to develop, implement and test disaster recovery functions using backup technologies.\n\nDemonstrated expert project management skills.\n\nInterpersonal skills sufficient to work with both technical and non-technical personnel at various levels in the organization. Ability to elicit and communicate technical and non-technical information in a clear and concise manner.\n\nDemonstrated ability to maintain a climate of fairness, cooperation. Demonstrated skill leading technical teams, including organizing workflow and scheduling assignments. Ability to work independently on complex technical projects as well as on a team of technical professionals and departmental decision-makers. Position requires frequent interface with senior level personnel on matters of significance.\n\nAbility to solve complex problems and perform work assignments requiring independent thought and judgment\n\nKnowledge of current industry practices, trends and resources (i.e., vendors, agencies, etc.)\n\n\nPreferred Qualifications\n\n\nClarity Data Model Certification\n\n\nAbout UCSF\n\n\nAt UCSF Health, our mission of innovative patient care, advanced technology and pioneering research is redefining what’s possible for the patients we serve – a promise we share with the professionals who make up our team.\n\n\n\n\nConsistently ranked among the top 10 hospitals nationwide by U.S. News & World Report – UCSF Health is committed to providing the most rewarding work experience while delivering the best care available anywhere. In an environment that allows for continuous learning and opportunities for professional growth, UCSF Health offers the ideal atmosphere in which to best use your skills and talents.\n\n\nPride Values\n\n\nUCSF is a diverse community made of people with many skills and talents. We seek candidates whose work experience or community service has prepared them to contribute to our commitment to professionalism, respect, integrity, diversity and excellence – also known as our PRIDE values.\n\n\n\n\nIn addition to our PRIDE values, UCSF is committed to equity – both in how we deliver care as well as our workforce. We are committed to building a broadly diverse community, nurturing a culture that is welcoming and supportive, and engaging diverse ideas for the provision of culturally competent education, discovery, and patient care. Additional information about UCSF is available at diversity.ucsf.edu\n\n\n\n\nJoin us to find a rewarding career contributing to improving healthcare worldwide.\n\n\nEqual Employment Opportunity\n\n\nThe University of California is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected status under state or federal law.\n\n\nOrganization\n\n\nHealth\n\n\nJob Code and Payroll Title\n\n\n000600 DATA SYS ANL 5\n\nJob Category\n\n\nClinical Systems / IT Professionals\n\nBargaining Unit\n\n\n99 - Policy-Covered (No Bargaining Unit)\n\nEmployee Class\n\n\nCareer\n\n\nPercentage\n\n\n100%\n\n\nLocation\n\n\nSan Francisco, CA\n\nCampus\n\n\nMission Center Building (SF)\n\nWork Style\n\n\nFlexible\n\n\nShift\n\n\nDays\n\n\nShift Length\n\n\n8 Hours\n\nAdditional Shift Details\n\n\nMonday - Friday\nMostrar más\nConsulta evaluaciones de la empresa\nEsta empresa ya no tendrá secretos para ti\nInicia sesión para buscar evaluaciones auténticas, calificaciones anónimas y datos sobre los sueldos antes de postularte.\nIniciar sesión\n3.7\n58 %\nRecomendar a un amigo\n56 %\nAprobación del CEO\nCEO: Suresh Gunasekaran\nCalificaciones 70",
    "Enlace": "https://www.glassdoor.com/job-listing/data-warehouse-architect-ucsf-health-JV_IC1147401_KO0,24_KE25,36.htm?jl=1009791100045"
  },
  {
    "Descripción": "Innova Software Services\nGenAI Architect\nInicia sesión para postularte\nPlano, TX\nInicia sesión para postularte\nHi Dheeraj,\nThanks for applying for the job through Indeed.com.\nKindly share your current location, employer details and updated resume to proceed further.\nGenAI Architect\nLocation: Plano, TX\nLong Term\nOverview:\nA GenAI Architect is a specialist who designs, builds, and maintains architectures for Generative AI applications and platforms.\nThis role requires a blend of technical expertise in AI/ML, cloud platforms, and software engineering with an understanding of business needs and problem-solving skills.\nResponsibilities\nDesigning and implementing GenAI architectures that align with business objectives.\nCollaborating with various teams (business stakeholders, data scientists, ML engineers) to understand requirements and implement GenAI solutions.\nDeveloping and deploying AI models, specifically those leveraging generative AI technologies like LLMs (Large Language Models), GANs, VAEs, and transformer models.\nDesigning and governing Retrieval-Augmented Generation (RAG) pipelines for contextually relevant and accurate responses.\nSelecting and integrating tools and frameworks such as LangChain, LangGraph, LlamaIndex, MLflow, Kubeflow, and Airflow.\nImplementing MLOps/LLMOps for automated CI/CD, model fine-tuning, evaluation, and monitoring.\nEnsuring security, governance, and compliance in GenAI implementations (e.g., PII redaction, model output moderation, bias checks).\nOptimizing cost-to-serve through dynamic model routing and resource auto-scaling.\nDeveloping and optimizing prompts and templates to guide LLM behavior.\nBuilding proofs of concept (PoCs) and prototypes to explore new solutions.\nMentoring other solution teams and evangelizing best practices in GenAI.\nStaying abreast of latest advancements in GenAI and cloud technologies.\nProviding thought leadership through whitepapers, blogs, and industry events.\nTechnical Skills:\nGenerative Models: Deep understanding and practical experience with LLMs, GANs, VAEs, transformers, and diffusion models.\nPrompt Engineering: Designing and refining prompts to optimize LLM outputs.\nRetrieval-Augmented Generation (RAG): Expertise in designing and governing RAG pipelines, including embedding generation, indexing, and prompt assembly.\nLLMOps/MLOps: Experience with model fine-tuning, deployment, monitoring, and scaling.\nCloud Computing: Proficiency in cloud platforms like AWS, Azure, or GCP, including their GenAI services (e.g., Azure OpenAI, Amazon Bedrock, Vertex AI).\nVector Databases: Mastery of vector databases (e.g., Pinecone, Weaviate, FAISS) for handling high-dimensional data.\nProgramming Languages: Strong proficiency in Python is crucial, along with knowledge of Java or other relevant languages.\nDeep Learning Frameworks: Hands-on experience with TensorFlow, PyTorch, etc.\nData Management: Skills in data preparation, processing, and handling large datasets.\nSecurity and Compliance: Knowledge of AI ethics, governance, bias mitigation, and compliance regulations.\nContainerization: Experience with technologies like Docker and Kubernetes (GKE) for deployment.\nJob Types: Full-time, Contract\nPay: $120,000.00 - $140,000.00 per year\nWork Location: In person\nMostrar más\nEncuentra el empleo de tus sueños\nLee reseñas auténticas con una cuenta de Glassdoor. Postúlate únicamente a los empleos que te gusten.\nIniciar sesión",
    "Enlace": "https://www.glassdoor.com/job-listing/genai-architect-innova-software-services-JV_IC1140045_KO0,15_KE16,40.htm?jl=1009811569374"
  },
  {
    "Descripción": "Association of Biomolecular Resource Facilities\nBioinformatics Software Architect\n\nArizona\n\nThermo Fisher Scientific\n\nArizona, AZ\n\n\nWork Schedule\n\nStandard (Mon-Fri)\n\nEnvironmental Conditions\n\nAdherence to all Good Manufacturing Practices (GMP) Safety Standards, Office\n\nJob Description\n\nThermo Fisher Scientific Inc. is the world leader in serving science, with annual revenue exceeding $40 billion. Our Mission is to enable our customers to make the world healthier, cleaner and safer. Whether our customers are accelerating life sciences research, solving complex analytical challenges, improving patient diagnostics and therapies or improving productivity in their laboratories, we are here to support them.\n\nMake an impact!\n\nThis is a key position within the Transplant Diagnostics R&D Bioinformatics team, based in West Hills, CA. The successful candidate will have the opportunity to partner with lab scientists, data analysts, software engineers and domain experts to build pioneering technologies and develop innovative molecular typing and antibody detection products.\n\nThe successful candidate will develop, improve, and maintain tools, pipelines, and software for the analysis of complex HLA typing data from PCR, microarray, NGS, and antibody detection platforms. This role will work in collaboration with the research staff and other departments, and requires knowledge of data analysis methods, software development, bioinformatics, statistics, molecular biology, as well as the ability to quickly grasp new subject areas.\n\nWhat will you do?\n\nBuild software tools, including development and implementation of new computational algorithms using machine learning and statistical models to provide solutions for process automation and data analytics for the R&D and manufacturing teams\n\nDevelop pipelines for NGS analysis and other bioinformatics workflows\n\nBuild and maintain Bioinformatics web portal for communication and distribution of Bioinformatics tools throughout the Transplant Diagnostics division\n\nWork with IT team to administer Bioinformatics infrastructure to ensure a robust and scalable architecture that effectively supports Bioinformatics software\n\nSearch relevant sequence information from external sources for primer and probe design, as well as mining and analysis of genomic libraries and genomes\n\nAnalyze and interpret complex experimental results and work hand in hand with laboratory scientists for the research and development of new molecular and antibody products\n\nActively participate in software development lifecycle, including writing software specifications, code and design reviews, implementing test plans\n\nRegularly communicate accomplishments and progress to team members and management\n\nEducation / Experience\n\nPhD from an accredited higher learning institution with studies in Computer Science, Bioinformatics, Computation Biology, Life Sciences/Molecular Biology or related field AND 2 years of related postdoctoral or industrial experience; OR master’s degree in Computer Science, Bioinformatics, Computational Biology, Life Sciences/Molecular Biology or related field AND 4 years of related work experience; OR bachelor’s degree in Computer Science, Bioinformatics, Computational Biology, Life Sciences/Molecular Biology or related field AND 6 years of related work experience\n\nExperience developing analytical software tools using machine learning methods and programming languages, such as C#, Python, and SQL\n\nExperience developing relational databases\n\nExperience in developing web tools and services\n\nExperience with cloud technologies such as AWS and docker\n\nKnowledge, Skills, Abilities\n\nAbility to translate scientific and business requirements to build robust and scalable software tools\n\nProficiency in building and maintaining NGS or other bioinformatics analysis pipelines\n\nProficiency working in Windows and Linux environments\n\nPragmatic self-starter who is proactive, self-motivated, team-oriented, and customer-focused with a strong work ethic\n\nAbility to meet deadlines within a dynamic environment and able to handle multiple tasks simultaneously while adapting to changing priorities\n\nBe curious, detail oriented, and analytical, with a proven ability to learn quickly\n\nSound understanding of statistics, machine learning algorithms, the ability to generate robust predictive models for multidimensional data\n\nProactively learns products and new projects and stays ahead with Bioinformatics, computational or industry trends\n\nGood verbal and written communication and well-founded problem-solving skills\n\nDemonstrated skills in project management and formal continuous process improvement techniques\n\nAbility to work effectively in collaboration with diverse groups of people\n\nPreferred Qualifications\n\nKnowledge of immunology, HLA\n\nExperience administrating a Linux system\n\nUnderstanding wet lab techniques and principles in the field of Molecular Biology, Genomics, and/or Biochemistry\n\n\nJob Information\nMostrar más\nEncuentra el empleo de tus sueños\nLee reseñas auténticas con una cuenta de Glassdoor. Postúlate únicamente a los empleos que te gusten.\nIniciar sesión",
    "Enlace": "https://www.glassdoor.com/job-listing/bioinformatics-software-architect-association-of-biomolecular-resource-facilities-JV_KO0,33_KE34,81.htm?jl=1009833008085"
  },
  {
    "Descripción": "AARP\n4.0\nSolution Architect, Generative Artificial Intelligence (AI)\n\nWashington, DC\n\nOverview:\n\n\nAARP is the nation's largest nonprofit, nonpartisan organization dedicated to empowering people 50 and older to choose how they live as they age. With a nationwide presence, AARP strengthens communities and advocates for what matters most to the more than 100 million Americans 50-plus and their families: health and financial security, and personal fulfillment. AARP also works for individuals in the marketplace by sparking new solutions and allowing carefully chosen, high-quality products and services to carry the AARP name. As a trusted source for news and information, AARP produces the nation's largest-circulation publications, \nAARP The Magazine\n and the \nAARP Bulletin\n.\n\nThe Generative AI Solution Architect will harness the power of Large Language Models (LLMs) and other cutting‑edge AI technologies to design and develop interactive chatbots and conversational interfaces that deliver exceptional value to AARP’s members and support the organization’s advocacy efforts. By leveraging these advanced models, the architect will create personalized, engaging, and informative experiences that address member needs, provide timely support, and foster a deeper connection between AARP and its community. This role will drive innovation in AARP’s member engagement strategies, enhance the overall member experience, and amplify the organization’s advocacy initiatives through the effective application of generative AI technologies.\n\nResponsibilities:\n\nEstablishes a technical roadmap for the platform and/or capability strategy and lifecycle that considers value-based outcomes, costs to maintain, supportability, and performance.\n\nEnsures sound integration, data, security, and business architecture design throughout all stages within the platform and/or capability lifecycle.\n\nProvides rapid delivery and development of technical solutions that align with business and/or platform desired outcomes.\n\nTroubleshoots and resolves technical issues related to platform or capability systems, solutions, and services.\n\nInnovates and drives continuous improvements of implementation methodology and technical service offerings based on customer/employee experiences or other enterprise objectives/outcomes.\n\nParticipates in a Community of Interest for engineers across all capability and platform teams to share information and strengthen understanding of business needs and technology-based business solutions.\n\nDevelops and maintains deep technical knowledge and expertise related to domain area systems, solutions, services, and applications.\n\nQualifications:\n\nBachelor’s or Master’s degree in Computer Science, Data Science, Engineering, or a related field.\n\n10+ years of experience in cloud infrastructure management and architecture, with deep expertise in AWS services including Bedrock and S3.\n\n2+ years of hands-on experience with Generative AI platforms and LLMs, including prompt engineering and building RAG pipelines.\n\n2+ years of experience implementing AI governance and ethical AI practices, including bias detection, toxicity filtering, and privacy compliance using tools like AWS Bedrock Guardrails.\n\n3+ years of experience in cybersecurity, including real-time incident response and infrastructure security best practices.\n\nDemonstrated success leading rapid prototyping and MVP development within cross-functional teams under tight deadlines.\n\nProven ability to evaluate and integrate LLMs into enterprise applications such as multi-turn, context-aware chatbots.\n\nStrong understanding of data ingestion pipelines and integration with platforms like Adobe Experience Manager (AEM), Salesforce APIs, and AWS S3\n\nAARP will not sponsor an employment visa for this position at this time.\n\n\n\n\nAdditional Requirements\n\n\n\nRegular and reliable job attendance\n\nEffective verbal and written communication skills\n\nExhibit respect and understanding of others to maintain professional relationships\n\nIndependent judgement in evaluation options to make sound decisions\n\nHome office environment with the ability to work effectively surrounded by moderate home environment noise\n\nCompensation and Benefits\n\n\n\nAARP offers a competitive compensation and benefits package including a 401(k); 100% company-funded pension plan; health, dental, and vision plans; life insurance; paid time off to include company and individual holidays, vacation, sick, caregiving, and parental leave; performance-based and peer-based recognition and tuition reimbursement.\n\n\n\n\n\n\nEqual Employment Opportunity\n\n\n\nAARP is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. AARP does not discriminate on the basis of race, ethnicity, religion, sex, color, national origin, age, sexual orientation, gender identity or expression, mental or physical disability, genetic information, veteran status, or on any other basis prohibited by applicable law.\nMostrar más\nConsulta evaluaciones de la empresa\nEsta empresa ya no tendrá secretos para ti\nInicia sesión para buscar evaluaciones auténticas, calificaciones anónimas y datos sobre los sueldos antes de postularte.\nIniciar sesión\n4.0\n77 %\nRecomendar a un amigo\n100 %\nAprobación del CEO\nCEO: Dr. Myechia Minter-Jordan\nCalificaciones 7",
    "Enlace": "https://www.glassdoor.com/job-listing/solution-architect-generative-artificial-intelligence-ai-aarp-JV_IC1138213_KO0,56_KE57,61.htm?jl=1009834185247"
  },
  {
    "Descripción": "eBay\n4.0\nCloud Architect\n\nAtlanta, GA\n\nAt eBay, we're more than a global ecommerce leader — we’re changing the way the world shops and sells. Our platform empowers millions of buyers and sellers in more than 190 markets around the world. We’re committed to pushing boundaries and leaving our mark as we reinvent the future of ecommerce for enthusiasts.\n\n\n\nOur customers are our compass, authenticity thrives, bold ideas are welcome, and everyone can bring their unique selves to work — every day. We're in this together, sustaining the future of our customers, our company, and our planet.\n\n\n\nJoin a team of passionate thinkers, innovators, and dreamers — and help us connect people and build communities to create economic opportunity for all.\n\nFully Remote (Within the United States)\n\n\n\n\nAbout the team and the role:\n\nTCGplayer connects hobbyists and hobby businesses to communities. We relentlessly improve the exchange of things and thoughts that fuel passions, providing the most compelling destination and tools for collectible card game enthusiasts and professional sellers! TCGplayer, now a part of eBay, promotes and drives growth of our products and services by connecting a global community of millions of buyers with tens of thousands of retailers in a $25B global collectible hobby market.\n\n\n\nThe Cloud Architecture team collaborates across TCGplayer and eBay teams to ensure systems and technologies seamlessly work together. As a Cloud Architect, you will play a critical role in designing, implementing, and optimizing solutions in our AWS environment. You will serve as a trusted advisor, collaborating with product and engineering teams to deliver scalable, secure, and cost-effective solutions that enable innovation and operational efficiency.\n\nBy leveraging your expertise in AWS and systems architecture, you will help our organization bridge the gap between product vision and engineering execution, driving technical excellence and ensuring the successful delivery of cloud-based solutions.\n\nOur team prides itself on a culture that fosters camaraderie, embraces diversity, and exudes passion! We are one of New York State’s 50 best employers and Fortune.com’s top 100 companies for women in the U.S.\n\n\n\n\nWhat you will accomplish:\n\nDesign and implement robust, scalable, and secure cloud architectures using AWS\n\nCollaborate with product and engineering teams to align cloud strategies with business goals\n\nDevelop and enforce best practices for systems architecture, deployment, and operations of systems in the cloud\n\nProvide guidance and mentorship to engineering teams on cloud-native technologies and architectural patterns\n\nEvaluate and recommend tools, frameworks, and processes to enhance cloud infrastructure and workflows\n\nEnsure the reliability, availability, and security of cloud environments through effective monitoring and incident management strategies\n\nOptimize cloud resources for cost efficiency while maintaining performance and scalability\n\nServe as a technical liaison between product managers and engineering teams, ensuring seamless communication and execution\n\nWhat you will bring:\n\nA relevant bachelor’s degree and 8 years of relevant industry, a relevant master's degree and 6 years of relevant industry, or 12 years of practical experience\n\nProven experience as a Cloud Architect or similar role, with a preferred focus on AWS.\n\nExpertise in systems architecture, including designing and implementing scalable and resilient solutions in the cloud\n\nStrong understanding of cloud-native technologies, including containers (e.g., Docker, Kubernetes) and serverless architectures as well hands-on experience with AWS services including EC2, S3, RDS, Lambda, and VPC design\n\nComfortable with Infrastructure as Code (IAC) tools such as CloudFormation or Terraform\n\nExperience with DevOps practices, including CI/CD pipelines and Infrastructure as Code (IaC) such as Terraform and CloudFormation\n\nThe base pay range for this position is expected in the range below:\n\n$115,200 - $199,700\n\nBase pay offered may vary depending on multiple individualized factors, including location, skills, and experience. The total compensation package for this position may also include other elements, including a target bonus and restricted stock units (as applicable) in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as PTO and parental leave). Details of participation in these benefit plans will be provided if an employee receives an offer of employment.\n\nIf hired, employees will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.\n\nPlease see the Talent Privacy Notice for information regarding how eBay handles your personal data collected when you use the TCGplayer Careers website or apply for a job with TCGplayer.\n\nTCGplayer, a subsidiary company of eBay, is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at careers@tcgplayer.com. We will make every effort to respond to your request for disability assistance as soon as possible. View our accessibility info to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities. It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.\n\nThe eBay Jobs website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.\nMostrar más\nConsulta evaluaciones de la empresa\nEsta empresa ya no tendrá secretos para ti\nInicia sesión para buscar evaluaciones auténticas, calificaciones anónimas y datos sobre los sueldos antes de postularte.\nIniciar sesión\n4.0\n73 %\nRecomendar a un amigo\n76 %\nAprobación del CEO\nCEO: Jamie Iannone\nCalificaciones 1,232",
    "Enlace": "https://www.glassdoor.com/job-listing/cloud-architect-ebay-JV_IC1155583_KO0,15_KE16,20.htm?jl=1009774154794"
  }
]